/*
*********************************************************************************************************
*
*	模块名称 : 主界面
*	文件名称 : mainui.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*
*********************************************************************************************************
*/
#ifndef _MAINUI_H
#define _MAINUI_H


/**********************包含头文件*************************/

#include "app_gui.h"
#include "common.h"
/**********************************/ 

	   
  
 /**********************图标数目定义*************************/ 
#define HOME_BMP_NUMS	8	//主界面图标个数 
  

/**********************************/

#define MENU_DEPTH	3	//主界面图标个数 
  
  
  
 /**********************界面参数定义*************************/   
#define MUI_BACK_COLOR		LIGHTBLUE		//MUI选择图标底色
#define MUI_FONT_COLOR 		BLUE 			//MUI字体颜色

#define MUI_EX_BACKCOLOR	0X0000			//窗体外部背景色
#define MUI_IN_BACKCOLOR	0X8C51			//窗体内部背景色

#define BMP_FONT_SIZE	24			//界面图标距离液晶顶部的距离
/**********************************/



/**********************导出变量*************************/
//各图标/图片路径
extern  char *const mui_icon_path_tbl[GUI_LANGUAGE_NUM][HOME_BMP_NUMS]; //图标路径表


/**********************************/






/**********************************/

/**********************导出变量*************************/

/**********************************/



/**********************导出函数*************************/

void mui_load_icon(void);

uint8_t mui_touch_chk(void);

void main_screen(void);
uint8_t gui_touch_chk(_gui_dev *buttonID);
/**********************************/


#endif




















 




