/*
*********************************************************************************************************
*
*	模块名称 :预热界面模块
*	文件名称 : preheat.h
*	版    本 : V1.0
*	说    明 : 预热界面
*
*
*********************************************************************************************************
*/
#ifndef __PREHEAT_H
#define __PREHEAT_H 	 

/**********************包含头文件*************************/
#include "app_gui.h"

/*****************************************/

#define BED_ID	0
#define E1_ID	1
#define FAN_ID	2


extern char *const infor_temp_bed[GUI_LANGUAGE_NUM];
extern char *const infor_temp_extu1[GUI_LANGUAGE_NUM];




/**********************导出函数*************************/
void preheat_screen(void);


/*****************************************/
#endif
