/*
*********************************************************************************************************
*
*	模块名称 :打印速度设置
*	文件名称 : speed.h
*	版    本 : V1.0
*	说    明 : 速度设置
*
*
*********************************************************************************************************
*/
#ifndef __SPEED_H
#define __SPEED_H 	 

/**********************包含头文件*************************/
#include "app_gui.h"




/*****************************************/
void  speed_screen(void);

void set_print_speed(_obj_option_e opt,u8 stepID);
void display_print_speed(_obj_option_e opt,u8 stepID);

/*****************************************/
#endif
